Description: Downloads the latest version of Wispr Flow and creates a package.
Identifier: com.github.betzerc-recipes.pkg.WisprFlow
ParentRecipe: com.github.dataJAR-recipes.download.WisprFlow
MinimumVersion: "2.3"

Input:
  NAME: Wispr Flow

Process:
  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/%NAME%/Wispr Flow.app"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
