Description: Downloads the latest version of Wispr Flow and creates a package.
Identifier: com.github.betzerc-recipes.pkg.Wispr Flow
ParentRecipe: com.github.dataJAR-recipes.download.Wispr Flow
MinimumVersion: "2.3"

Input:
  BUNDLE_ID: com.electron.wispr-flow.pkg
  NAME: Wispr Flow

Process:
  - Processor: AppDmgExtractioner
    Arguments:
      dmg_path: "%pathname%"
      unarchive_path: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: AppPkgCreator
    Arguments:
      app_path: "%RECIPE_CACHE_DIR%/%NAME%/Wispr Flow.app"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
