Description: Downloads the latest version of Wispr Flow and creates a package.
Identifier: com.github.betzerc-recipes.pkg.Wispr Flow
ParentRecipe: com.github.dataJAR-recipes.download.Wispr Flow
MinimumVersion: "2.3"

Input:
  BUNDLE_ID: com.electron.wispr-flow.pkg
  NAME: Wispr Flow

Process:
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"
      
  - Processor: PkgRootCreator
    Arguments:
      pkgdirs:
        Applications: "0775"
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"

  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%NAME%.app"
      source_path: "%pathname%/*.app"

  - Processor: AppPkgCreator
    Arguments:
      pkg_request:
        chown:
          - group: admin
            path: Applications
            user: root
      app_path: "%RECIPE_CACHE_DIR%/%NAME%/Applications/Wispr Flow.app"
      pkg_path: "%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg"
